In [208]:
import numpy as np
import pandas as pd

In [209]:
labels = ['x', 'y', 'z']
my_list = [100,200,300]
arr = np.array([100,200,300])
d = {'x':100, 'y':200, 'z':300}

In [210]:
pd.Series(my_list)

0    100
1    200
2    300
dtype: int64

In [211]:
pd.Series(data=my_list, index=labels)

x    100
y    200
z    300
dtype: int64

In [212]:
print(pd.Series(arr))
print(pd.Series(arr,np.array(labels)))

0    100
1    200
2    300
dtype: int64
x    100
y    200
z    300
dtype: int64

In [213]:
pd.Series(d)

x    100
y    200
z    300
dtype: int64

In [214]:
a = [i for i in range(1,5)]
b = [i for i in range(5,9)]
c = [i for i in range(9,13)]

In [215]:
pd.DataFrame(data=[a,b,c], index='a b c'.split(), columns='w x y z'.split())

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [216]:
pd.DataFrame(list(zip(a,b,c)))

   0  1   2
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [217]:
my_list = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]
pd.DataFrame(my_list, 'a b c'.split(), 'w x y z'.split()).T

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [218]:
pd.DataFrame(np.random.randn(5,4),columns='w x y z'.split(),index='a b c d e'.split())

          w         x         y         z
a  0.063498 -1.345162  2.335081 -2.273916
b -0.012226  0.692905 -0.109971 -0.981955
c  0.198052  0.681529  1.356332  1.128327
d  0.666785 -1.202318  0.710091  0.999196
e -0.906945 -0.633838 -0.189667  0.953438

In [219]:
my_d = {'a':[1,2,3,4], 'b':[5,6,7,8], 'c':[9,10,11,12]}
df = pd.DataFrame(my_d, index='w x y z'.split())
df

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [220]:
df.loc['add'] = [1,2,3]
df

     a  b   c
w    1  5   9
x    2  6  10
y    3  7  11
z    4  8  12
add  1  2   3

In [221]:
df['new'] = [1,2,3,4,5]
df

     a  b   c  new
w    1  5   9    1
x    2  6  10    2
y    3  7  11    3
z    4  8  12    4
add  1  2   3    5

In [222]:
df.insert(1,'insert',['a','b','c','d','e'])
df

     a insert  b   c  new
w    1      a  5   9    1
x    2      b  6  10    2
y    3      c  7  11    3
z    4      d  8  12    4
add  1      e  2   3    5

In [223]:
df.drop('insert',axis=1)

     a  b   c  new
w    1  5   9    1
x    2  6  10    2
y    3  7  11    3
z    4  8  12    4
add  1  2   3    5

In [224]:
df.drop('insert',axis=1,inplace=True)
df

     a  b   c  new
w    1  5   9    1
x    2  6  10    2
y    3  7  11    3
z    4  8  12    4
add  1  2   3    5

In [225]:
df.drop('add', axis=0)

   a  b   c  new
w  1  5   9    1
x  2  6  10    2
y  3  7  11    3
z  4  8  12    4

In [226]:
df

     a  b   c  new
w    1  5   9    1
x    2  6  10    2
y    3  7  11    3
z    4  8  12    4
add  1  2   3    5

In [185]:
df.reset_index()

     a  b   c  new
w    1  5   9    1
x    2  6  10    2
y    3  7  11    3
z    4  8  12    4
add  1  2   3    5

In [227]:
df.reset_index(inplace=True)
df

  index  a  b   c  new
0     w  1  5   9    1
1     x  2  6  10    2
2     y  3  7  11    3
3     z  4  8  12    4
4   add  1  2   3    5

In [230]:
df.rename(columns={'index':'new_col'},inplace=True)

In [231]:
kota = ['jkt','bsd','bks','bgr','tgr']
df['kota'] = kota
df

  new_col  a  b   c  new kota
0       w  1  5   9    1  jkt
1       x  2  6  10    2  bsd
2       y  3  7  11    3  bks
3       z  4  8  12    4  bgr
4     add  1  2   3    5  tgr

In [232]:
df.set_index('kota')

     new_col  a  b   c  new
kota
jkt        w  1  5   9    1
bsd        x  2  6  10    2
bks        y  3  7  11    3
bgr        z  4  8  12    4
tgr      add  1  2   3    5

In [233]:
df.set_index('kota',inplace=True)
df

     new_col  a  b   c  new
kota
jkt        w  1  5   9    1
bsd        x  2  6  10    2
bks        y  3  7  11    3
bgr        z  4  8  12    4
tgr      add  1  2   3    5